src/config/Documents/а_ПриказНаВВодВЭксплуатацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>а_ПриказНаВВодВЭксплуатацию</Name>
			<BasedOn>
				<xr:Item>Document.ВводВЭксплуатациюОС</xr:Item>
				<xr:Item>Document.ПередачаМалоценныхАктивовВЭксплуатацию</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаМалоценныхАктивовВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводВЭксплуатациюОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользованияБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛиквидационнаяСтоимостьБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МалоценныеАктивы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеИспользования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НазначенияИспользования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МОЛДолжность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/Documents/а_ПриказНаВВодВЭксплуатацию/Ext/ManagerModule.bsl
#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти  

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПриказПокупкаОС";
	КомандаПечати.Представление = НСтр("ru='Печать приказа на покупку ОС';uk='Друк наказу на купівлю ОЗ'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru='Реестр документов ""Приказ на покупку ОС""';uk='Реєстр документів ""Наказ на купівлю ОЗ""'");
	КомандаПечати.Обработчик     = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

	// Проверяем, нужно ли для макета ОтчетККМ формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриказПокупкаОС") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПриказПокупкаОС",
			НСтр("ru='Печать приказа на покупку ОС';uk='Друк наказу про купівлю ОЗ'"),
			ПолучитьТабличныйДокумент_Приказ(МассивОбъектов, ОбъектыПечати, ИмяМакета),
			,
			ИмяМакета);
	КонецЕсли;
		
		
КонецПроцедуры

Функция ПолучитьТабличныйДокумент_Приказ(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КомлпектВодителю";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = ПолучитьМакет("МакетПриказа");

	Для Каждого Док Из МассивОбъектов Цикл
		СтруктураПараметров = ПолучитьСтруктуру(Док);
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(Область); 
		

		Если Док.ОС.Количество() Тогда
			Для Каждого ОС Из Док.ОС Цикл
				
				Область = Макет.ПолучитьОбласть("Строка");
				Результат = Новый Структура;
				Результат.Вставить("ОсновноеСредство", СокрЛП(ОС.ОсновноеСредство));
				Результат.Вставить("ИнвентарныйНомер", СокрЛП(ОС.ИнвентарныйНомер));
		
				Область.Параметры.Заполнить(Результат);
				ТабличныйДокумент.Вывести(Область);

			КонецЦикла;
			
			Область = Макет.ПолучитьОбласть("Пункт2");
			Область.Параметры.Заполнить(СтруктураПараметров);
			ТабличныйДокумент.Вывести(Область);

			Область = Макет.ПолучитьОбласть("Пункт3");
			Область.Параметры.Заполнить(СтруктураПараметров);
			ТабличныйДокумент.Вывести(Область);

			Область = Макет.ПолучитьОбласть("Пункт4");
			Область.Параметры.Заполнить(СтруктураПараметров);
			ТабличныйДокумент.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("Пункт5");
			Область.Параметры.Заполнить(СтруктураПараметров);
			ТабличныйДокумент.Вывести(Область);
			
		ИначеЕсли Док.МалоценныеАктивы.Количество() Тогда
			Для Каждого МНМА Из Док.МалоценныеАктивы Цикл
				
				Область1 = Макет.ПолучитьОбласть("СтрокаМНМА1");
				Область2 = Макет.ПолучитьОбласть("СтрокаМНМА2");
				Область3 = Макет.ПолучитьОбласть("СтрокаМНМА3");
				
				Результат = Новый Структура;
				Результат.Вставить("НазначениеИспользования", СокрЛП(МНМА.НазначениеИспользования));
				Результат.Вставить("Количество", СокрЛП(МНМА.Количество));
				Результат.Вставить("МОЛДолжность", СокрЛП(МНМА.МОЛДолжность));
				Результат.Вставить("ФизЛицо", СокрЛП(МНМА.ФизЛицо));
				
				СрокПолезногоИспользования = МНМА.НазначениеИспользования.СрокПолезногоИспользования;
				Лет = Цел(СрокПолезногоИспользования/12);
				Месяцев = СрокПолезногоИспользования%12;
				Результат.Вставить("СрокПолезногоИспользования",
					?(Лет > 0, ""+ Лет + ?(Лет = 1, " рік"," років"), "") +
					?(Месяцев > 0 , ""+ ?(Лет > 0, " ", "") + Месяцев + " місяців", "")
				);
		
				Область1.Параметры.Заполнить(Результат);
				ТабличныйДокумент.Вывести(Область1);
				Если Не СрокПолезногоИспользования = 0 Тогда
					Область2.Параметры.Заполнить(Результат);
					ТабличныйДокумент.Вывести(Область2);
				КонецЕсли;
				Область3.Параметры.Заполнить(Результат);
				ТабличныйДокумент.Вывести(Область3);
			КонецЦикла;
			
			Область = Макет.ПолучитьОбласть("Пункт2");
			Область.Параметры.Заполнить(СтруктураПараметров);
			ТабличныйДокумент.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("Пункт5МНМА");
			Область.Параметры.Заполнить(СтруктураПараметров);
			ТабличныйДокумент.Вывести(Область);

		КонецЕсли;
				
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(Область);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;  
	
КонецФункции

Функция ПолучитьСтруктуру(Док)
	
	Результат = Новый Структура;
	Результат.Вставить("ОрганизацияПолноеНаименование", Док.Организация.НаименованиеПолное);
	Результат.Вставить("ИНН", Док.Организация.КодПоЕДРПОУ);
	Результат.Вставить("НомерПриказа", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Док.Номер));
	Результат.Вставить("ДатаПриказа", Формат(Док.Дата,"Л=uk_UA; ДФ='dd MMMM yyyy р.'"));
	
	Лет = Цел(Док.СрокПолезногоИспользованияБУ/12);
	Месяцев = Док.СрокПолезногоИспользованияБУ%12;
	Результат.Вставить("СрокПолезногоИспользованияБУ",
		?(Лет > 0, ""+ Лет + ?(Лет = 1, " рік"," років"), "") +
		?(Месяцев > 0 , ""+ ?(Лет > 0, " ", "") + Месяцев + " місяців", "")
	);
	
	Результат.Вставить("День", День(Док.Дата));
	Результат.Вставить("Месяц", Месяц(Док.Дата));
	Результат.Вставить("Год", Год(Док.Дата)); 
	
	Результат.Вставить("ГородИспользования", Сред(Док.ПодразделениеОрганизации,СтрНайти(Док.ПодразделениеОрганизации, "м."),СтрДлина(Док.ПодразделениеОрганизации)));
	
	Результат.Вставить("МОЛДолжность", Док.МОЛДолжность);
	
	ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СокрЛП(Док.МОЛБУ));
	Результат.Вставить("МОЛБУ",
		СтрШаблон("%1 %2. %3",
			ФИО.Фамилия,
			ВРег(Лев(ФИО.Имя,1)),
			?(ПустаяСтрока(ФИО.Отчество), "", ВРег(Лев(ФИО.Отчество,1)+ "."))			
		)
	);
	
	ОтвЛица = ОтветственныеЛицаБП.ОтветственныеЛица(Док.Организация, Док.Дата);
	Результат.Вставить("Должность", ОтвЛица.РуководительДолжностьПредставление);
	Результат.Вставить("ФИО", ОтвЛица.РуководительПредставление);
	
	//Результат.Вставить("Пункт", ?(Док.СрокПолезногоИспользованияБУ = 0, 4, 5)); 
	Результат.Вставить("ЛиквидационнаяСтоимость", ?(Док.ЛиквидационнаяСтоимостьБУ = 0, "нулю",
		ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Док.ЛиквидационнаяСтоимостьБУ, ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета(), "uk")
	));

	
	Возврат Результат;
	
КонецФункции
